#Задание выданное на лекции от 18.10.2021
#Напишите программу, которая получает на вход два натуральных числа и определяет их НОД
a, b = map(int, input("Введите два числа ").split())
b1 = b
a1 = a 
while a != b:
    if a > b:
        a = a - b
    else:
        b = b - a
if a == 1:
    print("(" + str(a1) + "," + str(b1) + ")" + " - взаимнопростые")
else:
    print("НОД (" + str(a1) + "," + str(b1) + ") = " + str(a))
