#Задание выданное на лекции от 18.10.2021
#Напишите программу, которая получает на вход натуральное число и определяет есть ли одинаковые цифры
a = list(map(int,input("Введите натуральное число ").split()))

    
print(c)