#Задание выданное на лекции от 18.10.2021
a = int(input("Сколько раз повторить, что ВГУЭС лучше ДВФУ? "))
for i in range(a):
    print("ВГУЭС лучше ДВФУ!")
